#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/CrutoiAlexandru/aws-server/runs/run-BCjUFj5cP27t2ByF

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
aws_iam_role.mgmnt-role: Refreshing state... [id=mgmnt-role]
aws_budgets_budget.basic-budget: Refreshing state... [id=919293050237:basic-monthly-budget]
aws_security_group.aws-mgmnt-sg: Refreshing state... [id=sg-0db082e1ce2b0d5dc]
aws_security_group.jenkins-server-sg: Refreshing state... [id=sg-0dfa93de1e75441d7]
aws_iam_role_policy_attachment.mgmnt-policy-attachment: Refreshing state... [id=mgmnt-role-20230419122043462400000002]
aws_iam_instance_profile.mgmnt-profile: Refreshing state... [id=mgmnt-profile]
aws_instance.jenkins-server: Refreshing state... [id=i-08fdbf9a2b38be72b]
aws_security_group.aws-mgmnt-sg: Drift detected (update)
aws_security_group.jenkins-server-sg: Drift detected (update)
aws_iam_instance_profile.mgmnt-profile: Drift detected (update)
aws_iam_role.mgmnt-role: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.server-mgmnt will be created
  + resource "aws_instance" "server-mgmnt" {
      + ami                                  = "ami-0d497a49e7d359666"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "mgmnt-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0db082e1ce2b0d5dc",
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @CrutoiAlexandru, Action: `pull_request`*